InformationRegisters/МестаОсуществленияДеятельностиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаОсуществленияДеятельностиИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВетИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПодконтрольныхОбъектовВетИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМОД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаОсуществленияДеятельностиИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеСпискаМОД

Процедура ОбновитьСписокМестОсуществленияДеятельности(СписокМОДИзСервиса, ДополнительныеПараметры) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить(Метаданные.РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ПолноеИмя());

	НачатьТранзакцию();

	Попытка
		Блокировка.Заблокировать();
		
		Если ДополнительныеПараметры.Обновление Тогда
			ОбновитьСписокМОДПоДаннымИзСервиса(СписокМОДИзСервиса, ДополнительныеПараметры);
		ИначеЕсли ДополнительныеПараметры.Регистрация Тогда
			ОбновитьСписокМОДПослеРегистрацииВСервисе(СписокМОДИзСервиса);
		ИначеЕсли ДополнительныеПараметры.Удаление Тогда
			ОбновитьСписокМОДПослеУдаленияВСервисе(СписокМОДИзСервиса);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось загрузить список мест осуществления деятельности по причине:
				 |%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщения);

		ВызватьИсключение ТекстСообщения;

	КонецПопытки;
		
КонецПроцедуры	

Процедура ОбновитьСписокМОДПоДаннымИзСервиса(СписокМОД, ДополнительныеПараметры)
	
	ТаблицаМОДИзСервиса = Новый ТаблицаЗначений();
	ТаблицаМОДИзСервиса.Колонки.Добавить("Владелец",                 Метаданные.ОпределяемыеТипы.ОрганизацияКонтрагентГосИС.Тип);
	ТаблицаМОДИзСервиса.Колонки.Добавить("ТоварнаяГруппа",           Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппыГИСМТ"));
	ТаблицаМОДИзСервиса.Колонки.Добавить("КПП",                      ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаМОДИзСервиса.Колонки.Добавить("ИНН",                      ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаМОДИзСервиса.Колонки.Добавить("КодФИАС",                  ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаМОДИзСервиса.Колонки.Добавить("ИдентификаторМОД",         ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаМОДИзСервиса.Колонки.Добавить("ПредставлениеАдреса",      ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаМОДИзСервиса.Колонки.Добавить("ДанныеАдреса",             ОбщегоНазначения.ОписаниеТипаСтрока(1000));
		
	СоответствиеИменТоварныхГрупп = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварныеГруппыГИСМТ.Ссылка КАК ТоварнаяГруппа,
		|	ТоварныеГруппыГИСМТ.Имя КАК Имя
		|ИЗ
		|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеИменТоварныхГрупп.Вставить(ВыборкаДетальныеЗаписи.Имя, ВыборкаДетальныеЗаписи.ТоварнаяГруппа);
	КонецЦикла;
	
	СписокИНН = Новый Массив();
	
	Для Каждого ДанныеПоМОД Из СписокМОД Цикл
		СписокТоварныхГрупп = ДанныеПоМОД.ТоварныеГруппы;
		
		ВладелецМОД = ДополнительныеПараметры.Владелец;
		
		Если ВладелецМОД = Неопределено Тогда
			ОбщегоНазначенияИСПереопределяемый.ЗаполнитьОрганизациюПоИННКПП(ВладелецМОД, ДанныеПоМОД.ИНН, ДанныеПоМОД.КПП);
			
			Если ВладелецМОД = Неопределено И Не ДополнительныеПараметры.СОтборомПоИНН Тогда
				ОбщегоНазначенияИСПереопределяемый.ЗаполнитьОрганизациюПоИННКПП(ВладелецМОД, ДанныеПоМОД.ИНН, "");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СписокИНН.Найти(ДанныеПоМОД.ИНН) = Неопределено Тогда
			СписокИНН.Добавить(ДанныеПоМОД.ИНН);
		КонецЕсли;
		
		Для Каждого ИмяТоварнойГруппы Из СписокТоварныхГрупп Цикл
			ТоварнаяГруппа = СоответствиеИменТоварныхГрупп.Получить(ИмяТоварнойГруппы);

			Если ТоварнаяГруппа = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			СтрокаТаблицыМОД = ТаблицаМОДИзСервиса.Добавить();
			СтрокаТаблицыМОД.ТоварнаяГруппа = ТоварнаяГруппа;
			
			Если ВладелецМОД <> Неопределено Тогда
				СтрокаТаблицыМОД.Владелец = ВладелецМОД;
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтрокаТаблицыМОД, ДанныеПоМОД);

		КонецЦикла;

	КонецЦикла;
	
	ОтборПоТоварнымГруппам = Новый Массив;
	
	Если ДополнительныеПараметры.ТоварныеГруппы.Количество() Тогда
		ОтборПоТоварнымГруппам = ДополнительныеПараметры.ТоварныеГруппы;
	КонецЕсли;
	
	//Запрос списка МОД осуществляется с отбором по ИНН. Поэтому список МОД в базе получаем с отбором по ИНН
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокМОД.Владелец КАК Владелец,
		|	СписокМОД.ТоварнаяГруппа КАК ТоварнаяГруппа,
		|	СписокМОД.КПП КАК КПП,
		|	СписокМОД.ИНН КАК ИНН,
		|	СписокМОД.КодФИАС КАК КодФИАС,
		|	СписокМОД.ПредставлениеАдреса КАК ПредставлениеАдреса,
		|	СписокМОД.ДанныеАдреса КАК ДанныеАдреса,
		|	СписокМОД.ИдентификаторМОД КАК ИдентификаторМОД
		|ПОМЕСТИТЬ втСписокМОДИзСервиса
		|ИЗ
		|	&СписокМОД КАК СписокМОД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестаОсуществленияДеятельностиИСМП.ТоварнаяГруппа КАК ТоварнаяГруппа,
		|	МестаОсуществленияДеятельностиИСМП.КПП КАК КПП,
		|	МестаОсуществленияДеятельностиИСМП.КодФИАС КАК КодФИАС,
		|	МестаОсуществленияДеятельностиИСМП.ИНН КАК ИНН,
		|	МестаОсуществленияДеятельностиИСМП.ПредставлениеАдреса КАК ПредставлениеАдреса,
		|	МестаОсуществленияДеятельностиИСМП.ДанныеАдреса КАК ДанныеАдреса,
		|	МестаОсуществленияДеятельностиИСМП.Владелец КАК Владелец,
		|	МестаОсуществленияДеятельностиИСМП.ИдентификаторМОД КАК ИдентификаторМОД
		|ПОМЕСТИТЬ втСписокМОДИзБазы
		|ИЗ
		|	РегистрСведений.МестаОсуществленияДеятельностиИСМП КАК МестаОсуществленияДеятельностиИСМП
		|ГДЕ
		|	МестаОсуществленияДеятельностиИСМП.ИНН В (&СписокИНН) %1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.ТоварнаяГруппа ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.ТоварнаяГруппа
		|		ИНАЧЕ втСписокМОДИзСервиса.ТоварнаяГруппа
		|	КОНЕЦ КАК ТоварнаяГруппа,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.КодФИАС ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МОДУдален,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.ИНН ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.ИНН
		|		ИНАЧЕ втСписокМОДИзСервиса.ИНН
		|	КОНЕЦ КАК ИНН,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.КПП ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.КПП
		|		ИНАЧЕ втСписокМОДИзСервиса.КПП
		|	КОНЕЦ КАК КПП,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.КодФИАС ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.КодФИАС
		|		ИНАЧЕ втСписокМОДИзСервиса.КодФИАС
		|	КОНЕЦ КАК КодФИАС,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.ПредставлениеАдреса ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.ПредставлениеАдреса
		|		ИНАЧЕ втСписокМОДИзСервиса.ПредставлениеАдреса
		|	КОНЕЦ КАК ПредставлениеАдреса,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.ДанныеАдреса ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.ДанныеАдреса
		|		ИНАЧЕ втСписокМОДИзСервиса.ДанныеАдреса
		|	КОНЕЦ КАК ДанныеАдреса,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.Владелец ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.Владелец
		|		ИНАЧЕ втСписокМОДИзСервиса.Владелец
		|	КОНЕЦ КАК Владелец,
		|	ВЫБОР
		|		КОГДА втСписокМОДИзСервиса.ИдентификаторМОД ЕСТЬ NULL
		|			ТОГДА втСписокМОДИзБазы.ИдентификаторМОД
		|		ИНАЧЕ втСписокМОДИзСервиса.ИдентификаторМОД
		|	КОНЕЦ КАК ИдентификаторМОД
		|ИЗ
		|	втСписокМОДИзСервиса КАК втСписокМОДИзСервиса
		|		ПОЛНОЕ СОЕДИНЕНИЕ втСписокМОДИзБазы КАК втСписокМОДИзБазы
		|		ПО втСписокМОДИзСервиса.ТоварнаяГруппа = втСписокМОДИзБазы.ТоварнаяГруппа
		|		И втСписокМОДИзСервиса.ИНН = втСписокМОДИзБазы.ИНН
		|		И втСписокМОДИзСервиса.КПП = втСписокМОДИзБазы.КПП
		|		И втСписокМОДИзСервиса.КодФИАС = втСписокМОДИзБазы.КодФИАС";
	
	Если ОтборПоТоварнымГруппам.Количество() Тогда
		УсловиеОтбораПоТГ = " И МестаОсуществленияДеятельностиИСМП.ТоварнаяГруппа В (&ТоварныеГруппы)";
	Иначе
		УсловиеОтбораПоТГ = "";
	КонецЕсли;
	
	Запрос       = Новый Запрос;
	Запрос.Текст = СтрШаблон(ТекстЗапроса, УсловиеОтбораПоТГ);
	Запрос.УстановитьПараметр("СписокМОД", ТаблицаМОДИзСервиса);
	Запрос.УстановитьПараметр("СписокИНН", СписокИНН);
	
	Если ЗначениеЗаполнено(УсловиеОтбораПоТГ) Тогда
		Запрос.УстановитьПараметр("ТоварныеГруппы", ОтборПоТоварнымГруппам);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ТоварнаяГруппа", Справочники.ТоварныеГруппыГИСМТ.ПустаяСсылка());
		СтруктураОтбора.Вставить("ИНН",            "");
		СтруктураОтбора.Вставить("КПП",            "");
		СтруктураОтбора.Вставить("КодФИАС",        "");
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, ВыборкаДетальныеЗаписи);
		
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтруктураОтбора);
		
		Запись.Прочитать();
		
		Если ВыборкаДетальныеЗаписи.МОДУдален И Запись.Выбран() Тогда
			Запись.Удалить();
			
		Иначе		
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
			
			Запись.ПредставлениеАдреса      = ВыборкаДетальныеЗаписи.ПредставлениеАдреса;
			Запись.ДатаПоследнегоОбновления = ТекущаяДатаСеанса();
			
			Запись.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСписокМОДПослеРегистрацииВСервисе(СписокЗарегистрованныхМОД) Экспорт
	
	Для Каждого РегистрируемыйМОД Из СписокЗарегистрованныхМОД Цикл
		Для Каждого ТоварнаяГруппа Из РегистрируемыйМОД.ТоварныеГруппы Цикл
			ЗаписьМОД = СоздатьМенеджерЗаписи();

			ЗаполнитьЗначенияСвойств(ЗаписьМОД, РегистрируемыйМОД);

			ЗаписьМОД.ТоварнаяГруппа           = ТоварнаяГруппа;
			ЗаписьМОД.ДатаПоследнегоОбновления = ТекущаяДатаСеанса();

			ЗаписьМОД.Записать();

		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСписокМОДПослеУдаленияВСервисе(УдаляемыйМОД) Экспорт
	
	УдаляемаяЗапись = СоздатьМенеджерЗаписи();
	УдаляемаяЗапись.ТоварнаяГруппа = УдаляемыйМОД.ТоварнаяГруппа;
	УдаляемаяЗапись.ИНН            = УдаляемыйМОД.ИНН;
	УдаляемаяЗапись.КПП            = УдаляемыйМОД.КПП;
	УдаляемаяЗапись.КодФИАС        = УдаляемыйМОД.КодФИАС;
	
	УдаляемаяЗапись.Прочитать();
	
	Если УдаляемаяЗапись.Выбран() Тогда
		УдаляемаяЗапись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновитьСписокМОДПриПроверкеДокументов(СписокМОД) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить(Метаданные.РегистрыСведений.МестаОсуществленияДеятельностиИСМП.ПолноеИмя());

	НачатьТранзакцию();

	Попытка
		Блокировка.Заблокировать();
		
		Для Каждого НаборМОД Из СписокМОД Цикл
			Владелец      = НаборМОД.Ключ;
			МОДыИзСервиса = НаборМОД.Значение;

			Для Каждого ИмяТоварнойГруппы Из МОДыИзСервиса.ТоварныеГруппы Цикл
				ЗаписьМОДаВБазе = СоздатьМенеджерЗаписи();
				ТоварнаяГруппа  = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ТоварнаяГруппаПоРеквизиту("Имя", ИмяТоварнойГруппы);
				
				ЗаписьМОДаВБазе.ТоварнаяГруппа = ТоварнаяГруппа;
				
				ЗаполнитьЗначенияСвойств(ЗаписьМОДаВБазе, МОДыИзСервиса, "ИНН,КПП,КодФИАС");

				ЗаписьМОДаВБазе.Прочитать();

				Если Не ЗаписьМОДаВБазе.Выбран() Тогда
					ЗаполнитьЗначенияСвойств(ЗаписьМОДаВБазе, МОДыИзСервиса);
					
					ЗаписьМОДаВБазе.ТоварнаяГруппа = ТоварнаяГруппа;
					ЗаписьМОДаВБазе.Владелец       = Владелец;
					ЗаписьМОДаВБазе.ДанныеАдреса   = РаботаСАдресами.АдресПоИдентификатору(МОДыИзСервиса.КодФИАС);

					Если ЗаписьМОДаВБазе.ДанныеАдреса <> Неопределено Тогда
						ЗаписьМОДаВБазе.ПредставлениеАдреса = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(
							ЗаписьМОДаВБазе.ДанныеАдреса);
					КонецЕсли;

				КонецЕсли;

				ЗаписьМОДаВБазе.ДатаПоследнегоОбновления = ТекущаяДатаСеанса();

				ЗаписьМОДаВБазе.Записать();

			КонецЦикла;

		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		ОтменитьТранзакцию();

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось загрузить список мест осуществления деятельности по причине:
				 |%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщения);

		Возврат Ложь

	КонецПопытки;
	
КонецФункции

#КонецОбласти

// Товарные группы с возможностью регистрации МОД, по которым ведется учет.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ТоварныеГруппыГИСМТ - Товарные группы с возможностью регистрации МОД
Функция ДоступныеТоварныеГруппыСВозможностьюРегистрацииМОД() Экспорт
	
	Результат = Новый СписокЗначений();

	Запрос = Новый Запрос;
	Запрос.Текст = Справочники.ТоварныеГруппыГИСМТ.ТекстЗапросаТоварныхГруппСОтборомПоЭлементуКонструктора();
	
	Запрос.УстановитьПараметр("ЭлементКонструктораДляОпределенияДоступныхВидовПродукции", ПредопределенноеЗначение(
		"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДоступнаРегистрацияМОДВГИСМТ"));

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ТоварнаяГруппа = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(Выборка.Ссылка);
		Результат.Добавить(ТоварнаяГруппа, Строка(ТоварнаяГруппа));
	КонецЦикла;
	
	Результат.СортироватьПоПредставлению();
	
	Возврат Результат.ВыгрузитьЗначения();
	
КонецФункции

// Имеются подконтрольные объекты ВЕТИС.
// 
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - Организация, по которой проверяем наличие подконтрольных объектов ВЕТИС
// 
// Возвращаемое значение:
//  Булево - Имеются подконтрольные объекты ВЕТИС
Функция ИмеютсяПодконтрольныеОбъектыВЕТИС(Организация) Экспорт
	
	ОбъектВЕТИС = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МестаОсуществленияДеятельностиИСМП.НаличиеПодконтрольныхОбъектовВетИС КАК НаличиеПодконтрольныхОбъектовВетИС
	|ИЗ
	|	РегистрСведений.МестаОсуществленияДеятельностиИСМП КАК МестаОсуществленияДеятельностиИСМП
	|ГДЕ
	|	МестаОсуществленияДеятельностиИСМП.Владелец = &Владелец";

	Запрос.УстановитьПараметр("Владелец", Организация);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектВЕТИС = ВыборкаДетальныеЗаписи.НаличиеПодконтрольныхОбъектовВетИС;
	КонецЦикла;

	Возврат ОбъектВЕТИС;
	
КонецФункции

Функция СписокЗарегистрированныхМестОсуществленияДеятельности(Владелец, ТоварнаяГруппа, КПП, КодФИАС="", Первые=0, ВыполнятьПроверку=Ложь) Экспорт
	
	СписокЗарегистрированныхМОД = Новый Массив;
	
	Если Первые > 0 Тогда
		ОтборПервые = СтрШаблон("ПЕРВЫЕ %1", Формат(Первые, "ЧРГ=; ЧГ=;"));
	Иначе
		ОтборПервые = "";
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ %1
	|	МестаОсуществленияДеятельностиИСМП.КодФИАС КАК КодФИАС,
	|	МестаОсуществленияДеятельностиИСМП.Владелец КАК Владелец,
	|	МестаОсуществленияДеятельностиИСМП.ТоварнаяГруппа КАК ТоварнаяГруппа,
	|	МестаОсуществленияДеятельностиИСМП.КПП КАК КПП,
	|	МестаОсуществленияДеятельностиИСМП.ДанныеАдреса КАК ДанныеАдреса,
	|	МестаОсуществленияДеятельностиИСМП.ПредставлениеАдреса КАК ПредставлениеАдреса,
	|	МестаОсуществленияДеятельностиИСМП.ИдентификаторМОД КАК ИдентификаторМОД
	|ИЗ
	|	РегистрСведений.МестаОсуществленияДеятельностиИСМП КАК МестаОсуществленияДеятельностиИСМП
	|ГДЕ
	|	МестаОсуществленияДеятельностиИСМП.Владелец = &Владелец
	|	И МестаОсуществленияДеятельностиИСМП.ТоварнаяГруппа = &ТоварнаяГруппа
	|	И МестаОсуществленияДеятельностиИСМП.КПП = &КПП",
	ОтборПервые);
	
	Запрос       = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("КПП",            КПП);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	Запрос.УстановитьПараметр("Владелец",       Владелец);
	
	Если ЗначениеЗаполнено(КодФИАС) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И МестаОсуществленияДеятельностиИСМП.КодФИАС = &КодФИАС";
		Запрос.УстановитьПараметр("КодФИАС", КодФИАС);
	КонецЕсли;
	
	Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(ТоварнаяГруппа) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И МестаОсуществленияДеятельностиИСМП.ИдентификаторМОД <> """"";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыполнятьПроверку Тогда
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДанныеАдреса) Или Не ЗначениеЗаполнено(
				ВыборкаДетальныеЗаписи.ПредставлениеАдреса) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		СтруктураМОД = Новый Структура;
		СтруктураМОД.Вставить("ТоварнаяГруппа", ВыборкаДетальныеЗаписи.ТоварнаяГруппа);
		СтруктураМОД.Вставить("КПП", ВыборкаДетальныеЗаписи.КПП);
		СтруктураМОД.Вставить("КодФИАС", ВыборкаДетальныеЗаписи.КодФИАС);
		СтруктураМОД.Вставить("ДанныеАдреса", ВыборкаДетальныеЗаписи.ДанныеАдреса);
		СтруктураМОД.Вставить("ПредставлениеАдреса", ВыборкаДетальныеЗаписи.ПредставлениеАдреса);
		СтруктураМОД.Вставить("ИдентификаторМОД", ВыборкаДетальныеЗаписи.ИдентификаторМОД);

		СписокЗарегистрированныхМОД.Добавить(СтруктураМОД);

	КонецЦикла;
	
	Возврат СписокЗарегистрированныхМОД;
	
КонецФункции

Функция ИнициализироватьПараметрыЗаписиМОД() Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Владелец",       Неопределено);
	ДополнительныеПараметры.Вставить("Обновление",     Ложь);
	ДополнительныеПараметры.Вставить("Регистрация",    Ложь);
	ДополнительныеПараметры.Вставить("Удаление",       Ложь);
	ДополнительныеПараметры.Вставить("СОтборомПоИНН",  Ложь);
	ДополнительныеПараметры.Вставить("ТоварныеГруппы", Неопределено);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция МестоОсуществленияДеятельностиЗагруженоИзГИСМТ(Владелец, ТоварнаяГруппа, КПП, КодФИАС) Экспорт
	
	СписокМОД = СписокЗарегистрированныхМестОсуществленияДеятельности(Владелец, ТоварнаяГруппа, КПП, КодФИАС, 1);
	
	Возврат СписокМОД.Количество() > 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли
